       01  REG-USUARIO.
           03 ID-USUARIO                 PIC 9(02).
           03 EMAIL                      PIC X(30).
           03 NOME                       PIC X(30).
           03 SENHA                      PIC X(8).
           03 TELEFONE                   PIC 9(13).
